; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-79)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l14)
    (at p3 l5)
    (at p4 l12)
    (at p5 l6)
    (at p6 l6)
    (at p7 l12)
    (at p8 l3)
    (at p9 l2)
    (at p10 l12)
    (at p11 l11)
    (at p12 l6)
    (at p13 l5)
    (at p14 l3)
    (at v1 l5)
    (at v2 l5)
    (at v3 l5)
    (at v4 l4)
    (at v5 l4)
    (at v6 l9)
    (road l4 l9)
    (road l5 l4)
    (road l14 l10)
    (road l3 l13)
    (road l8 l12)
    (road l2 l8)
    (road l6 l5)
    (road l6 l11)
    (road l6 l14)
    (road l7 l13)
    (road l14 l6)
    (road l4 l5)
    (road l5 l6)
    (road l3 l6)
    (road l8 l2)
    (road l8 l5)
    (road l9 l4)
    (road l13 l1)
    (road l10 l14)
    (road l13 l7)
    (road l12 l8)
    (road l5 l8)
    (road l11 l6)
    (road l13 l3)
    (road l1 l13)
    (road l6 l3)
    (road l5 l7)
    (road l7 l5)
    (road l10 l13)
    (road l13 l10)
    (road l4 l8)
    (road l8 l4)
    (road l2 l4)
    (road l4 l2)
    (road l3 l14)
    (road l14 l3)
    (road l5 l11)
    (road l11 l5)
    (road l5 l10)
    (road l10 l5)
    (road l2 l5)
    (road l5 l2)
    (road l3 l4)
    (road l4 l3)
    (road l2 l14)
    (road l14 l2)
    (road l3 l9)
    (road l9 l3)
    (road l1 l4)
    (road l4 l1)
    (road l3 l7)
    (road l7 l3)
    (road l7 l14)
    (road l14 l7)
    (road l9 l14)
    (road l14 l9)
    (road l4 l6)
    (road l6 l4)
    (road l4 l11)
    (road l11 l4)
    (road l7 l10)
    (road l10 l7)
    (road l1 l6)
    (road l6 l1)
    (road l2 l12)
    (road l12 l2)
    (road l2 l11)
    (road l11 l2)
    (road l7 l12)
    (road l12 l7)
    (road l8 l14)
    (road l14 l8)
    (road l2 l7)
    (road l7 l2)
    (road l8 l10)
    (road l10 l8)
    (road l3 l5)
    (road l5 l3)
    (road l12 l13)
    (road l13 l12)
    (road l1 l9)
    (road l9 l1)
    (road l1 l12)
    (road l12 l1)
    (road l1 l14)
    (road l14 l1)
    (road l2 l9)
    (road l9 l2)
    (road l4 l14)
    (road l14 l4)
    (road l2 l3)
    (road l3 l2)
    (road l9 l13)
    (road l13 l9)
    (road l1 l3)
    (road l3 l1)
    (road l4 l12)
    (road l12 l4)
    (road l6 l12)
    (road l12 l6)
    (road l3 l11)
    (road l11 l3)
    (road l7 l11)
    (road l11 l7)
    (road l5 l14)
    (road l14 l5)
    (road l1 l5)
    (road l5 l1)
    )
 (:goal (and 
(at p8 l5)
))
)

; plan
1. (drive v6 l9 l3)
   deleted: (at v6 l9)
   added: (at v6 l3)
   goals met: 0 of 1
2. (pick-up v6 l3 p8 c0 c1)
   deleted: (at p8 l3) (capacity v6 c1)
   added: (in p8 v6) (capacity v6 c0)
   goals met: 0 of 1
3. (drive v6 l3 l5)
   deleted: (at v6 l3)
   added: (at v6 l5)
   goals met: 0 of 1
4. (drop v6 l5 p8 c0 c1)
   deleted: (in p8 v6) (capacity v6 c0)
   added: (at p8 l5) (capacity v6 c1)
   goals met: 1 of 1
